In [1]:
import pandas as pd

In [17]:
data = [(1,2,3,4), 
        (5,6,7,8), 
        (9, 10, 11, 12),
        (13, 14, 15, 16) ]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [4]:
df

    c1  c2  c3  c4
11   1   2   3   4
12   5   6   7   8
13   9  10  11  12
14  13  14  15  16

In [18]:
df['c1']

l1     1
l2     5
l3     9
l4    13
Name: c1, dtype: int64

In [19]:
df[['c3', 'c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   9
l4  15  13

In [20]:
df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [21]:
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12

In [22]:
df[1:][['c3', 'c2']]

    c3  c2
l2   7   6
l3  11  10
l4  15  14

In [23]:
df[0:][['c3', 'c2']]

    c3  c2
l1   3   2
l2   7   6
l3  11  10
l4  15  14

In [24]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [26]:

df.loc['l3']

c1     9
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [27]:
df.loc['l1', 'c2']

2

In [28]:
df.iloc[0, 1]

2